[
  {
    "company": "7shifts",
    "logoSrc": "assets/companies/7shifts-rebrand.svg",
    "position": "Analytics Engineer",
    "date": "March 2025 - Present",
    "description": "Continuing my journey with 7Shifts, I have transitioned into a role as an analytics engineer. This role has allowed me to further develop my skills in data architecture, business data translation, and analytical modelling. I have been able to work on a variety of projects that have allowed me to gain a deeper understanding of the importance of pipeline architecture and the role it plays in the effective functioning of data-driven organizations. I have learned how to streamline data processing pipelines, improve data quality and integrity, and design and implement data models that can support scalable analytics. This role has been instrumental in shaping my understanding of the maintenance side of data work, providing me with a solid foundation to build upon in my career."
  },
  {
    "company": "7shifts",
    "logoSrc": "assets/companies/7shifts-rebrand.svg",
    "position": "Senior Data Analyst",
    "date": "March 2024 - March 2025",
    "description": "As I grew with 7Shifts, I was given the opportunity to take a leading role as an indivudal contributor. This included driving and owning several large scale analytical engineering projects, setting analytics best practices both within the team and throughout the larger company, and diving into creative and challangeing statistcal problems."
  },
  {
    "company": "University of Saskatchewan",
    "logoSrc": "assets/companies/usask-logo.png",
    "position": "Sessional Lecturer",
    "date": "September 2022 - Present",
    "description": "As a sessional lecturer, I have had the privilege to teach and lead diverse groups of students, each with their unique background and learning styles. This experience has taught me the importance of effective communication, leadership, and teaching strategies. In addition, I have learned how to motivate students to strive for a common goal of knowledge, whether through creative teaching methods, interactive class discussions, or individual attention. Through this work, I have developed my skills as a teacher, mentor, and leader, and have found great satisfaction in helping others achieve their academic goals."
  },
  {
    "company": "7shifts",
    "logoSrc": "assets/companies/7shifts-rebrand.svg",
    "position": "Data Analyst",
    "date": "June 2023 - February 2024",
    "description": "During my experience as an analyst focused on product growth, I have had the opportunity to develop a number of interesting skills. Firstly, this role has enabled me to foster my skills in growth experimentation, whether it be through formal or informal studies. Secondly, this position provided my first taste of analytics engineering, and the purpose it serves in a modern data team. Thirdly, I've had the opportunity to apply my skills in advanced modelling to develop deeper appreciation of the issues faced by a scale-up stage tech firm. Lastly, I have been able to drive business value with stakeholders from a variety of domains, including monetization, marketing, sales, engineering, etc."
  },
  {
    "company": "StandardAero",
    "logoSrc": "assets/companies/standardaero-logo.png",
    "position": "Business Process Data Scientist",
    "date": "July 2022 - June 2023",
    "description": "Throughout my work as an industrial data scientist, I have had the opportunity to gain valuable insights into the world of industrial and engineering simulation, applied statistics, and project management. This job has allowed me to apply my statistical knowledge to real-world business cases and effectively communicate the value of statistics in a risk-oriented industry. Additionally, this job has taught me the importance of effective deployment and communication of statistical results. My experiences in these areas have broadened my skill set and provided me with invaluable knowledge to carry forward."
  },
  {
    "company": "University of Toronto",
    "logoSrc": "assets/companies/utoronto-logo.png",
    "position": "Research Assistant",
    "date": "December 2021 - May 2022",
    "description": "As an economic research assistant, I had the opportunity to see behind the scenes of how innovation is sought in the field. While the role was fairly limited, I was able to apply my knowledge from natural language processing to assist in the analysis of large datasets. Through this experience, I gained a deeper appreciation for the rigor and attention to detail required in economic research and was able to further develop my skills in data analysis and research methodology. Overall, it was a valuable experience that provided me with a deeper understanding of the research process and the importance of interdisciplinary collaboration."
  },
  {
    "company": "University of Toronto",
    "logoSrc": "assets/companies/utoronto-logo.png",
    "position": "Teaching Assistant",
    "date": "September 2021 - April 2022",
    "description": "During my time as a teaching assistant, I gained valuable experience in public speaking and transferring knowledge. I was responsible for making statistics and machine learning concepts accessible and digestible for students who were new to the subject matter. This role allowed me to develop my communication skills and helped me to become a more effective teacher. I learned how to tailor my explanations to different learning styles and found creative ways to engage students with the material. This experience taught me the importance of clear and direct communication."
  },
  {
    "company": "Affinity Credit Union",
    "logoSrc": "assets/companies/affinity-logo.svg",
    "position": "Development and Database Manager",
    "date": "May 2021 - August 2021",
    "description": "As I progressed into my second summer internship with the same company, I was entrusted with more responsibilities, which helped me gain valuable insights into the industry. As a project lead, I had to work with different teams to ensure that the projects were executed successfully. This involved collaborating with external teams, which taught me the importance of effective communication and the ability to tailor technical language to non-technical stakeholders. The experience also provided me with a first taste of project management principles and methodologies."
  },
  {
    "company": "Affinity Credit Union",
    "logoSrc": "assets/companies/affinity-logo.svg",
    "position": "Development and Database Manager",
    "date": "May 2020 - September 2020",
    "description": "During my first summer internship with Affinity, I had the opportunity to work with the Business Intelligence and Automation team, where I gained valuable insights into the crucial aspects of data engineering, data architecture, and data server management. This experience has been instrumental in shaping my understanding of the maintenance side of data work, providing me with a solid foundation to build upon in my career. I learned how to streamline data processing pipelines, improve data quality and integrity, and design and implement data models that can support scalable analytics. This internship has helped me realize the importance of data infrastructure and the role it plays in the effective functioning of data-driven organizations."
  },
  {
    "company": "Affinity Credit Union",
    "logoSrc": "assets/companies/affinity-logo.svg",
    "position": "Market Analyst",
    "date": "January 2020 - April 2020",
    "description": "As an intern Market Analyst, I honed my skills in writing research findings for an industry audience, applying machine learning to real-world business problems, and performing qualitative economic analysis. The experience provided me with a valuable opportunity to immerse myself in the fast-paced world of business and engage with stakeholders at various levels. I truly gained a deeper understanding of the importance of market research and analysis in driving business success."
  },
  {
    "company": "University of Saskatchewan",
    "logoSrc": "assets/companies/usask-logo.png",
    "position": "Research Assistant",
    "date": "May 2019 - August 2019",
    "description": "My first research assistantship was in computer science, I gained an appreciation for the level of hard work and dedication required for successful research. I was responsible for generating background materials and literature reviews that formed the foundation for a research paper. This experience taught me the importance of attention to detail, as well as how to conduct thorough research and analysis to support a larger project."
  }
]